SELECT "Н_ЛЮДИ"."ИМЯ", "Н_ВЕДОМОСТИ"."ИД", "Н_СЕССИЯ"."ЧЛВК_ИД"
    FROM "Н_ЛЮДИ"
        RIGHT JOIN "Н_ВЕДОМОСТИ" ON
            "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
        RIGHT JOIN "Н_СЕССИЯ" ON
            "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД" AND "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
    WHERE
/*        "Н_ЛЮДИ"."ИМЯ" > 'Роман'
      AND
        "Н_ВЕДОМОСТИ"."ИД" < 1250972
      AND*/
        "Н_СЕССИЯ"."УЧГОД" = '2001/2002';

-- Prints nothing because db is cut and there is no such people with these ID's that
-- match "Н_СЕССИЯ"."ЧЛВК_ИД" with "Н_ЛЮДИ"."ИД"